
#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.ssh_key: Refreshing state... [id=afe54254fa2921f6f6aeaba2d2d378a690c215e6]
azurerm_resource_group.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust]
azurerm_public_ip.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/publicIPAddresses/pip-rust]
azurerm_log_analytics_workspace.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.OperationalInsights/workspaces/rust-law]
azurerm_virtual_network.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/virtualNetworks/vnet-rust]
azurerm_recovery_services_vault.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.RecoveryServices/vaults/rust-recovery-vault]
azurerm_maintenance_configuration.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Maintenance/maintenanceConfigurations/rust-mc]
azurerm_network_security_group.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/networkSecurityGroups/nsg-rust]
azurerm_subnet.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/virtualNetworks/vnet-rust/subnets/snet-internal]
azurerm_subnet_network_security_group_association.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/virtualNetworks/vnet-rust/subnets/snet-internal]
azurerm_network_interface.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/networkInterfaces/nic-rust]
azurerm_linux_virtual_machine.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Compute/virtualMachines/rust]
azurerm_backup_policy_vm.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.RecoveryServices/vaults/rust-recovery-vault/backupPolicies/rust-recovery-vault-policy]
azurerm_maintenance_assignment_virtual_machine.rust: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Compute/virtualMachines/rust/providers/Microsoft.Maintenance/configurationAssignments/rust-mc]
azurerm_backup_protected_vm.vm1: Refreshing state... [id=/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.RecoveryServices/vaults/rust-recovery-vault/backupFabrics/Azure/protectionContainers/iaasvmcontainer;iaasvmcontainerv2;rust;rust/protectedItems/VM;iaasvmcontainerv2;rust;rust]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_network_security_group.rust will be updated in-place
  ~ resource "azurerm_network_security_group" "rust" {
        id                  = "/subscriptions/6bd893d4-dacc-42fd-b06a-4453a88475ae/resourceGroups/rust/providers/Microsoft.Network/networkSecurityGroups/nsg-rust"
        name                = "nsg-rust"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = ""
              - destination_port_ranges                    = [
                  - "28015",
                  - "28017",
                ]
              - direction                                  = "Inbound"
              - name                                       = "RustUDP"
              - priority                                   = 105
              - protocol                                   = "Udp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = ""
              - destination_port_ranges                    = [
                  - "28016",
                  - "28082",
                ]
              - direction                                  = "Inbound"
              - name                                       = "RustTCP"
              - priority                                   = 110
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowMyIpAddressSSHInbound"
              - priority                                   = 120
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "108.195.21.24"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = ""
              + destination_port_ranges                    = [
                  + "28082",
                ]
              + direction                                  = "Inbound"
              + name                                       = "RustTCP"
              + priority                                   = 110
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_ranges                    = [
                  + "28015",
                  + "28017",
                ]
              + direction                                  = "Inbound"
              + name                                       = "RustUDP"
              + priority                                   = 105
              + protocol                                   = "Udp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
        tags                = {}
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_account.rust will be created
  + resource "azurerm_storage_account" "rust" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "eastus"
      + min_tls_version                   = "TLS1_2"
      + name                              = "garustysouth"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "rust"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
    }

  # azurerm_storage_container.rust will be created
  + resource "azurerm_storage_container" "rust" {
      + container_access_type   = "container"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "rust"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "garustysouth"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @robpitcher, Action: `pull_request`, Workflow: `Terraform Plan/Apply`*